charts/preview/load-test-output

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: ./load-test.js

    duration: -, iterations: -
         vus: 1, max: 1

    init [----------------------------------------------------------] starting
    ✓ status was 200

    checks.....................: 100.00% ✓ 20  ✗ 0  
    data_received..............: 70 kB   3.5 kB/s
    data_sent..................: 2.3 kB  113 B/s
    http_req_blocked...........: avg=9.89ms  min=0s      med=0s      max=197.87ms p(90)=1µs     p(95)=9.89ms 
    http_req_connecting........: avg=650.5µs min=0s      med=0s      max=13.01ms  p(90)=0s      p(95)=650.5µs
  ✓ http_req_duration..........: avg=20.7ms  min=16.67ms med=19.8ms  max=27.34ms  p(90)=23.73ms p(95)=26.4ms 
    http_req_receiving.........: avg=253.9µs min=48µs    med=79µs    max=3.61ms   p(90)=100.8µs p(95)=291.7µs
    http_req_sending...........: avg=50.2µs  min=38µs    med=45µs    max=98µs     p(90)=66.1µs  p(95)=68.55µs
    http_req_tls_handshaking...: avg=6.84ms  min=0s      med=0s      max=136.86ms p(90)=0s      p(95)=6.84ms 
    http_req_waiting...........: avg=20.4ms  min=16.53ms med=19.69ms max=27.21ms  p(90)=22.73ms p(95)=23.48ms
    http_reqs..................: 20      0.999989/s
    iteration_duration.........: avg=1.03s   min=1.01s   med=1.02s   max=1.21s    p(90)=1.02s   p(95)=1.04s  
    iterations.................: 19      0.949989/s
    vus........................: 1       min=1 max=1
    vus_max....................: 1       min=1 max=1